app/Controllers/Carrito_controller.php

    public function finalizar_compra() {
        $cart = \Config\Services::cart();
        $venta = new Ventas_model();
        $productos = new Productos_model();
        $detalle = new Venta_detalles_model();
        $cart1 = $cart->contents();

        //Verificar stock de todos los productos
        foreach ($cart1 as $item) {
            $producto = $productos->where('id_producto', $item['id'])->first();
---
SELECT *
FROM `productos`
WHERE `id_producto` = '2'
 LIMIT 1

        );

>>>>>>> 03e7710bdfbe63469780fb525aa5b0bf70987778
        $venta_id = $venta->insert($data);
---
INSERT INTO `venta` (`id_persona`, `forma_de_pago`, `forma_de_envio`, `total_venta`, `venta_fecha`) VALUES ('19', 'Tarjeta de Crédito', 'Envío a Domicilio', 1610000, '2025-06-12')


        //Registrar detalles y actualizar stock
        foreach ($cart1 as $item) {
            $producto = $productos->where('id_producto', $item['id'])->first();

            // Actualizar stock
            $nuevo_stock = $producto['stock_producto'] - $item['qty'];
            $productos->update($item['id'], ['stock_producto' => $nuevo_stock]);
---
SELECT *
FROM `productos`
WHERE `id_producto` = '2'
 LIMIT 1
UPDATE `productos` SET `stock_producto` = 0
WHERE `productos`.`id_producto` IN ('2')