app/Controllers/Personas_controller.php

            ];

            $persona = new Personas_model();
            $persona->insert($data);
---
INSERT INTO `personas` (`nombre_persona`, `apellido_persona`, `email_persona`, `contrasena_persona`, `cuil_persona`, `domicilio_persona`, `estado_persona`, `id_perfil`) VALUES ('Mariana', 'Martínez', 'marcela1@gmail.com', '$2y$10$Q0efXgzvLmWSmz7vdJxbaOdSDc96lUK3IZFw2.MJSr1RRc2xqyzsm', '23456788768', 'San Juan 345', 1, 2)