app/Controllers/Personas_controller.php

SELECT *
FROM `mensaje`
WHERE `mensaje`.`id_mensaje` = '4'
UPDATE `mensaje` SET `estado_mensaje` = 1
WHERE `mensaje`.`id_mensaje` IN ('4')
---
    public function modificar_estado($id_mensaje)
    {
        $mensajeModel = new Mensaje_model();
        $mensaje = $mensajeModel->find($id_mensaje);

        if ($mensaje) {
            $nuevo_estado = $mensaje['estado_mensaje'] == 0 ? 1 : 0; // Cambia el estado
            $mensajeModel->update($id_mensaje, ['estado_mensaje' => $nuevo_estado]);