app/Controllers/Productos_controller.php

    function gestionar_productos() {
        $producto_model = new Productos_model();
        $categorias_model = new Categorias_model();
        $data['categorias'] = $categorias_model->findAll();
        $data['productos'] = $producto_model->join('categorias', 'categorias.id_categoria = productos.id_categoria')->findAll();
---
SELECT *
FROM `categorias`
SELECT *
FROM `productos`
JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`id_categoria`

    public function tabla_productos()
    {
        $productos = new Productos_model();
        $categorias = new Categorias_model();
        $data['productos'] = $productos-> where('estado_producto', 1)->where('stock_producto >', 0)
            ->join('categorias', 'categorias.id_categoria = productos.id_categoria')
            ->findAll();
---
SELECT *
FROM `productos`
JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`id_categoria`
WHERE `estado_producto` = 1
AND `stock_producto` > 0

    public function listar_productos()
    {
        $productos = new Productos_model();
        $categorias = new Categorias_model();
        $data['productos'] = $productos-> where('estado_producto', 1)->where('stock_producto >', 0)
            ->join('categorias', 'categorias.id_categoria = productos.id_categoria')
            ->findAll();
---
SELECT *
FROM `productos`
JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`id_categoria`
WHERE `estado_producto` = 1
AND `stock_producto` > 0

    public function filtrar_productos($id_categoria=null)
    {
        $productos= new Productos_model();
        $categorias= new Categorias_model();

        $data['categorias'] = $categorias->findAll();
---
SELECT *
FROM `categorias`