app/Controllers/Productos_controller.php

    public function listar_productos()
    {
        $productos = new Productos_model();
        $categorias = new Categorias_model();
        $data['productos'] = $productos-> where('estado_producto', 1)->where('stock_producto >', 0)
            ->join('categorias', 'categorias.id_categoria = productos.id_categoria')
            ->findAll();
---
SELECT *
FROM `productos`
JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`id_categoria`
WHERE `estado_producto` = 1
AND `stock_producto` > 0