app/Controllers/Ventas_controller.php

     public function ver_comprasCliente() {
        $session = \Config\Services::session();
        $ventasModel = new Ventas_model();
        if (!$session->has('id_sesion')) {
            return redirect()->route('ingresar');
        }
        $id_cliente = $session->get('id_sesion');
        $data['titulo'] = 'Tus Compras';
        $data['ventas'] = $ventasModel->where('id_persona', $id_cliente)->findAll();
        $ventaDetallesModel = new Venta_detalles_model();
        $data['detalles'] = [];
        foreach ($data['ventas'] as $venta) {
            $detalles = $ventaDetallesModel->where('id_venta', $venta['id_venta'])->findAll();
            foreach ($detalles as &$detalle) {
                $detalle['descripcion_producto'] = (new Productos_model())->find($detalle['id_producto']);
---
SELECT *
FROM `venta`
WHERE `id_persona` = '18'
SELECT *
FROM `venta_detalles`
WHERE `id_venta` = '1'
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '1'